Catalogs/СтраховыеПолисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтраховыеПолисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Клиенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПолиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПолисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.умцСтраховыеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификаторВидовПолисовРЭМД</Name>
					<Comment>Вид полиса ОМС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСтраховыхПрограмм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСтраховыхПрограмм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтраховыеПолисы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолисОМСПоУмолчанию = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.ВидыПолисаОМС); // Полис ОМС единого образца, бессрочный
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДополнительныеСвойства = Новый Структура;
	
	// Сразу открываем форму выбора вида полисов
	Если Не ЗначениеЗаполнено(Объект.ВидПолиса) Тогда
		ОткрытьФорму("Справочник.ВидыПолисов.ФормаВыбора",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВыборВидаПолисаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбновитьОбъектИЭлементыПоВидуПолиса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДополнительныеСвойства.Вставить("ЗаписьНового", Объект.Ссылка.Пустая());
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.ВидПолиса, "Тип") = ПредопределенноеЗначение("Перечисление.ТипыСтраховыхПрограмм.ОМС") Тогда
		
		ПроверитьЗаполненностьОбязательногоПоля(Отказ, Элементы.КлассификаторВидовПолисовРЭМД,	Объект.КлассификаторВидовПолисовРЭМД,	НСтр("ru='Укажите вид полиса по классификатору'"));
		ПроверитьЗаполненностьОбязательногоПоля(Отказ, Элементы.Серия,							Объект.Серия,							НСтр("ru='Укажите серию полиса'"));
		ПроверитьЗаполненностьОбязательногоПоля(Отказ, Элементы.СрокДействияНачало,				Объект.СрокДействияНачало,				НСтр("ru='Укажите дату начала действия полиса'"));
		ПроверитьЗаполненностьОбязательногоПоля(Отказ, Элементы.СрокДействия,					Объект.СрокДействия,					НСтр("ru='Укажите дату окончания действия полиса'"));
		
		Если Не Отказ Тогда
			РезультатПроверки = ПроверитьПересечениеПолисовОМСИСформироватьСообщение(Объект.Владелец, Объект.СрокДействия, Объект.СрокДействияНачало, Объект.ВидПолиса, Объект.Ссылка);
			Если РезультатПроверки <> Неопределено Тогда
				Отказ = Истина;
				Оповещение = Новый ОписаниеОповещения("ПослеПроверкиПересеченийПолисовОМС", ЭтотОбъект, РезультатПроверки);
				ПоказатьВопрос(Оповещение, РезультатПроверки.ТекстСообщения, РежимДиалогаВопрос.ДаНет);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьОбязательногоПоля(Отказ, ЭлементПоля, ЗначениеПоля, ТекстСообщения)
	
	Если ЭлементПоля.Доступность
		И ЭлементПоля.АвтоОтметкаНезаполненного
		И Не ЗначениеЗаполнено(ЗначениеПоля)
	Тогда
		Отказ = Истина;
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ДополнительныеСвойства.ЗаписьНового Тогда
		ПараметрОповещения = Новый Структура("Полис, Клиент", Объект.Ссылка, Объект.Владелец);
		Оповестить("ЗаписьНовогоПолиса", ПараметрОповещения);
		
		// Для случая, когда оповещение о записи новой карты не приведет к заполнению пустой оснвной медкарты клиента.
		// Строго после оповещения формы клиента.
		ЗаполнитьОсновнойПолисКлиента(Объект.Ссылка, Объект.Владелец);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВидПолисаПриИзменении(Элемент)
	
	ОбновитьОбъектИЭлементыПоВидуПолиса();
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВидовПолисовРЭМДПриИзменении(Элемент)
	
	ОбновитьОбъектИЭлементыПоВидуПолиса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьОсновнойПолисКлиента(Полис, Клиент)
	
	Если Не ЗначениеЗаполнено(Клиент.умцОсновнойСтраховойПолис) Тогда
		ОбъектКлиент = Клиент.ПолучитьОбъект();
		ОбъектКлиент.умцОсновнойСтраховойПолис = Полис;
		ОбъектКлиент.ОбменДанными.Загрузка = Истина;
		Попытка
			ОбъектКлиент.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаПолисаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ВидПолиса = Результат;
	КонецЕсли;
	
	// Начинаем редактирование следующего незаполненного поля
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		ТекущийЭлемент = Элементы.Владелец;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Номер) Тогда
		ТекущийЭлемент = Элементы.Номер;
	КонецЕсли;
	
	ОбновитьОбъектИЭлементыПоВидуПолиса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПересечениеПолисовОМСИСформироватьСообщение(Знач Владелец, Знач СрокДействия, Знач СрокДействияНачало, Знач ВидПолиса, Знач Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраховыеПолисы.Ссылка КАК Ссылка,
		|	СтраховыеПолисы.СрокДействияНачало КАК СрокДействияНачало,
		|	СтраховыеПолисы.СрокДействия КАК СрокДействия,
		|	СтраховыеПолисы.Номер КАК Номер
		|ИЗ
		|	Справочник.СтраховыеПолисы КАК СтраховыеПолисы
		|ГДЕ
		|	СтраховыеПолисы.Владелец = &Владелец
		|	И (СтраховыеПолисы.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ (СтраховыеПолисы.СрокДействияНачало <= &СрокДействия
		|				И СтраховыеПолисы.СрокДействия >= &СрокДействияНачало))
		|	И СтраховыеПолисы.ВидПолиса.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыСтраховыхПрограмм.ОМС)
		|	И СтраховыеПолисы.Ссылка <> &Ссылка
		|	И СтраховыеПолисы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("СрокДействия", ?(ЗначениеЗаполнено(СрокДействия), СрокДействия, Дата(3999,12,31)));
	Запрос.УстановитьПараметр("СрокДействияНачало", ?(ЗначениеЗаполнено(СрокДействияНачало), СрокДействияНачало, Дата(1,1,1)));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщения = "";
	мСсылокПолисов = Новый Массив;
	Если Выборка.Количество() <> 0 Тогда
		ТекстСообщения = "Есть другой действующий полис ОМС:";
		Пока Выборка.Следующий() Цикл
			Номер = ?(ЗначениеЗаполнено(Выборка.Номер), Выборка.Номер, "не указан");
			СрокДействияНачало = ?(ЗначениеЗаполнено(Выборка.СрокДействияНачало), Формат(Выборка.СрокДействияНачало, "ДФ=dd.MM.yyyy"), "не указан");
			СрокДействия = ?(ЗначениеЗаполнено(Выборка.СрокДействия), Формат(Выборка.СрокДействия, "ДФ=dd.MM.yyyy"), "не указан");
			ТекстСообщения = ТекстСообщения + Символы.ПС + "№ " + Номер + " c " + СрокДействияНачало;
			мСсылокПолисов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ТекстСообщения = ТекстСообщения + Символы.ПС + "Завершить старый полис ОМС?"
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("мСсылокПолисов, ТекстСообщения", мСсылокПолисов, ТекстСообщения);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Функция ПослеПроверкиПересеченийПолисовОМС(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекстОшибки = "";
		ИзменитьДанныеПересекающихсяПолисов(ДопПараметры.мСсылокПолисов, Объект.СрокДействия, Объект.СрокДействияНачало, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ПоказатьПредупреждение(, ТекстОшибки);
		Иначе
			Записать();
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ДопПараметры.ТекстСообщения);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьДанныеПересекающихсяПолисов(мСсылокПолисов, СрокДействия, СрокДействияНачало, ТекстОшибки)
	
	Для Каждого Эл Из мСсылокПолисов Цикл
		
		Попытка
			ОбъектИзменяемыйПолис = Эл.ПолучитьОбъект();
			ОбъектИзменяемыйПолис.СрокДействия = СрокДействияНачало - 24*60*60;
			Если ОбъектИзменяемыйПолис.СрокДействияНачало > ОбъектИзменяемыйПолис.СрокДействия Тогда
				ОбъектИзменяемыйПолис.СрокДействияНачало = ОбъектИзменяемыйПолис.СрокДействия;
			КонецЕсли;
			ОбъектИзменяемыйПолис.Записать();
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = "Не удалось изменить срок действия полиса № " + ?(ЗначениеЗаполнено(Эл.Номер), Эл.Номер, "не указан") + " по причине: " + ТекстОшибки;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбъектИЭлементыПоВидуПолиса()
	
	ЭтоПолисОМС = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.ВидПолиса, "Тип") = ПредопределенноеЗначение("Перечисление.ТипыСтраховыхПрограмм.ОМС");
	
	Если Объект.Ссылка.Пустая()
		И ЭтоПолисОМС
		И Не ЗначениеЗаполнено(Объект.КлассификаторВидовПолисовРЭМД)
	Тогда
		Объект.КлассификаторВидовПолисовРЭМД = ПолисОМСПоУмолчанию;
	КонецЕсли;
	
	// 1 — Полис ОМС старого образца
	// 2 — Полис ОМС единого образца, бессрочный
	// 3 — Полис ОМС единого образца, со сроком действия
	// 4 — Временное свидетельство
	КодВидаПолисаОМС = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.КлассификаторВидовПолисовРЭМД, "УИДЕГИСЗ");
	
	Если ЭтоПолисОМС Тогда
		Элементы.КлассификаторВидовПолисовРЭМД.Видимость = Истина;
	Иначе
		Объект.КлассификаторВидовПолисовРЭМД = Неопределено;
		Элементы.КлассификаторВидовПолисовРЭМД.Видимость = Ложь;
	КонецЕсли;
	
	//КодВидаПолисаОМС = Объект.КлассификаторВидовПолисовРЭМД.
	Если ЭтоПолисОМС
		И КодВидаПолисаОМС <> 1
	Тогда
		Объект.Серия = "";
		Элементы.Серия.Доступность = Ложь;
	Иначе
		Элементы.Серия.Доступность = Истина;
	КонецЕсли;
	
	Элементы.Серия.Доступность = Не (ЭтоПолисОМС И КодВидаПолисаОМС <> 1);
	Элементы.Серия.АвтоОтметкаНезаполненного = ЭтоПолисОМС И КодВидаПолисаОМС = 1;
	Если Не Элементы.Серия.Доступность Тогда
		Объект.Серия = Неопределено;
	КонецЕсли;
	
	Элементы.СрокДействияНачало.Доступность = Не (ЭтоПолисОМС И КодВидаПолисаОМС = 2);
	Элементы.СрокДействияНачало.АвтоОтметкаНезаполненного = ЭтоПолисОМС И КодВидаПолисаОМС <> 2;
	Если Не Элементы.СрокДействияНачало.Доступность Тогда
		Объект.СрокДействияНачало = Неопределено;
	КонецЕсли;
	
	Элементы.СрокДействия.Доступность = Не ЭтоПолисОМС Или КодВидаПолисаОМС = 3 Или КодВидаПолисаОМС = 1;
	Элементы.СрокДействия.АвтоОтметкаНезаполненного = ЭтоПолисОМС И КодВидаПолисаОМС = 3;
	Если Не Элементы.СрокДействия.Доступность Тогда
		Объект.СрокДействия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
